snlkuharlocal/src/Documents/Комплектация/Комплектация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Комплектация</name>
  <comment>Комплектация</comment>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <registerRecords>AccumulationRegister.СпайкиВПути</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>EnumRef.Отгружен</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоРаскомплектация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервироватьПродукцию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВозвратИМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплектующих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидКомплектации</name>
      <type>
        <types>CatalogRef.ВидыКомплектаций</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплектующих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СтатусыЗаказаМарокДляДокументов/СтатусыЗаказаМарокДляДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаказаМарокДляДокументов</name>
  <resources>
    <name>СтатусыЗаказаКодовМаркировки</name>
    <type>
      <types>EnumRef.СтатусыЗаказаКодовМаркировки</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаказаМарок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВОборот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/СпайкиВПути/СпайкиВПути.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СпайкиВПути</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ВидСклада/ВидСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСклада</name>
  <enumValues>
    <name>Физический</name>
  </enumValues>
  <enumValues>
    <name>Виртуальный</name>
  </enumValues>
  <enumValues>
    <name>ВиртуальныйДляСклада</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыЗаказаКодовМаркировки/СтатусыЗаказаКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказаКодовМаркировки</name>
  <enumValues>
    <name>ТребуетсяЗаказМарок</name>
  </enumValues>
  <enumValues>
    <name>ЗаказаныМарки</name>
  </enumValues>
  <enumValues>
    <name>МаркиВведеныВОборот</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Комплектация/ObjectModule.bsl
Перем ПараметрыЗагрузки;

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 


//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
		
	ЕстьИзменения	=Модифицированность();
	НужноВыгружать	=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	//Кухарь 10.12.15 начало
	//Запрет создание документов по виртуальным складам в ЦО
	если Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада и ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
		#Если клиент тогда
			Сообщить("В ЦО запрещено создание документов по виртуальным складам");
		#КонецЕсли
		отказ=Истина;
	КонецЕсли;
	//Кухарь 10.12.15 конец
	
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли;		
	КонецЕсли;
	
	Если ЕстьИзменения Тогда 
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");	
		
		//Кухарь 31.05.18 начало
		//перенёс из призаписи() на форме документа	
		КоличествоДокумента = Товары.Итог("Количество");
		КоличествоКомплектующих = Комплектующие.Итог("Количество");
		//Кухарь 31.05.18 конец
		
		// Кухарь А.Ю. 13.05.2022 начало
		// для проверки, что руками ничего не наменяли
		КоличествоКомплектующихДляСверки=Комплектующие.Итог("КоличествоКомплектующих");
		если КоличествоКомплектующихДляСверки=0 тогда
			Для каждого СтрокаТЧ из Комплектующие цикл
				ЗаполнитьКоличествоКомплектующихПоСтроке(СтрокаТЧ);		
			КонецЦикла;			
		КонецЕсли;
		// Кухарь А.Ю. 13.05.2022 конец
		
		
		
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);
		
		// Кухарь А.Ю. 24.05.2022 начало
		// Контроль корректности комплектов
		если не ОбменДанными.Загрузка тогда
			если Товары.Итог("КоличествоКомплектующих")<> Комплектующие.Итог("КоличествоКомплектующих") и Комплектующие.Количество()>0 тогда
				СообщитьИзМодуля("Не совпадает количество комплектующих в таблице товаров и таблице комплектующие");
				отказ=Истина;
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю. 24.05.2022 конец
		
	КонецЕсли; 
	
	// Кельманов А.В. - SNL-239 - 2026.05.27 {
	ТипУзла = ПараметрыСеанса.ТипУзла;
	
	Если НужноВыгружать 
		И Не ОбменДанными.Загрузка 
		И ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение
		И Не ЭтоРаскомплектация
		И НужноЗаказатьКоды() Тогда
		
		НужноВыгружать = ПолучитьСтатусЗаказовКМПоНакладной(Ссылка);
		
		Если Не НужноВыгружать Тогда
			Если СостояниеНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад И Не ЭтоНовый() Тогда
				СостояниеНакладной = Перечисления.СостоянияНакладной.ЗаказКМЧЗ; 
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;	
	
	НачСостНакладной = Ссылка.СостояниеНакладной;
	ТекстСообщения = "";
	
	Если Не ЭтоРаскомплектация
		И (СостояниеНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад   		
		Или СостояниеНакладной = Перечисления.СостоянияНакладной.ПолученоСкладом
		Или СостояниеНакладной = Перечисления.СостоянияНакладной.ЗаказКМЧЗ)
		И (НачСостНакладной = Перечисления.СостоянияНакладной.ВРаботе Или НачСостНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад) 
		Тогда 

		Для Каждого Стр Из Товары Цикл 

			Если Стр.Номенклатура.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект И Не ЗначениеЗаполнено(Стр.Номенклатура.ГТИН) Тогда
				ТекстСообщения = ТекстСообщения + "В КМП: " + Ссылка + " в строке " + Стр.НомерСтроки + " не заполнен GTIN на " + Стр.Номенклатура + ", требующую маркировки." + Символы.ПС; 
			КонецЕсли; 
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда

			СообщитьИзМодуля(ТекстСообщения);  
			НужноВыгружать = Ложь;    
			СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе;

		КонецЕсли;
		
	КонецЕсли;
	// Кельманов А.В. - SNL-239 - 2026.05.27 }
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;	
	
	// Кухарь А.Ю. 12.05.2020 начало
	// Пересём дату за накладной или отгрузим ЗНБ
	если (СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена и ссылка.СостояниеНакладной<>Перечисления.СостоянияНакладной.Отгружена)
		или дата<>ссылка.Дата и не ЭтоНовый() тогда
		если ОбщегоНазначения_ПИ.ЭтоУзел_ODN_или_OD7() тогда
			Запрос=новый запрос;
			запрос.Текст=			"ВЫБРАТЬ
			|	ЗаданиеНабора.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
			|ГДЕ
			|	ЗаданиеНабора.Проведен
			|	И ЗаданиеНабора.Дата >= &Дата
			|	И ЗаданиеНабора.Накладная = &Накладная";
			запрос.УстановитьПараметр("Накладная",Ссылка);
			// Кухарь А.Ю. 01.04.2021 начало
			//запрос.УстановитьПараметр("Дата",НачалоДня(Ссылка.Дата)-30*24*3600);
		запрос.УстановитьПараметр("Дата",НачалоГода(Ссылка.Дата)-30*24*3600);	 
			// Кухарь А.Ю. 01.04.2021 конец
			
			
			результат=запрос.Выполнить().Выбрать();
			пока результат.Следующий() цикл
				ЗНБОбъект=результат.ссылка.получитьобъект();
				ЗНБОбъект.дата=дата;
				ЗНБОбъект.СостояниеНакладной=СостояниеНакладной;			
				// Кухарь А.Ю.  29.08.2022 начало
				// ЗНБОбъект.записать(РежимЗаписиДокумента.Проведение);
				 ЗНБОбъект.ЗаписатьЗНББезКонтроляСостояний(РежимЗаписиДокумента.Проведение);
				// Кухарь А.Ю.  29.08.2022 конец
		
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// Кухарь А.Ю. 12.05.2020 конец	
	
КонецПроцедуры

// Кельманов А.В. - SNL-239 - 2026.05.27
Функция НужноЗаказатьКоды()

	ЕстьКомплекты = Ложь;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&Номенклатура)
	|	И Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)";
	
	Запрос.УстановитьПараметр("Номенклатура", Товары.ВыгрузитьКолонку("Номенклатура"));
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ЕстьКомплекты = Истина;
	КонецЕсли;
	
	Возврат ЕстьКомплекты;
	
КонецФункции

// Кельманов А.В. - SNL-239 - 2026.05.27
Функция ПолучитьСтатусЗаказовКМПоНакладной(Накладная)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыЗаказаМарокДляДокументов.Накладная КАК Накладная
	               |ИЗ
	               |	РегистрСведений.СтатусыЗаказаМарокДляДокументов КАК СтатусыЗаказаМарокДляДокументов
	               |ГДЕ
	               |	СтатусыЗаказаМарокДляДокументов.СтатусыЗаказаКодовМаркировки = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказаКодовМаркировки.МаркиВведеныВОборот)
	               |	И СтатусыЗаказаМарокДляДокументов.Накладная = &Накладная";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	СостояниеНакладной	=Неопределено;
	//крохин начало
	Отгружен = Неопределено;
	//крохин конец
	
	Автор				=Неопределено;
	
	ДатаВыгрузки		=Неопределено;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	
	Если Основание = Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	ВидОснования	= Основание.Метаданные().Имя;		
	ДокОснование	= Основание;	
	ИБ				= Основание.ИБ;
	
	// Шворобей ВЮ 04.10.2022 ++
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
	
	Если ВидОснования = "ПриходнаяНакладная" И ЗначениеЗаполнено(Контрагент) Тогда
		Если ЗаполнениеДокументов.ЕстьЭлементСправочникаИнетМагазины(Контрагент) Тогда	
			ЭтоРаскомплектация = Истина;
			ЭтоВозвратИМ = Истина;
		КонецЕсли;
	КонецЕсли;
	// Шворобей ВЮ 04.10.2022 ++
	
	ВариантЗаполнения = Неопределено;
	#ЕСЛИ КЛИЕНТ ТОГДА
		//Кухарь 09.04.18 начало
		//КМП теперь будут и на основании ПРМ
		//	ВариантЗаполнения=ВыбратьВариантЗаполнения();
		если ВидОснования<>"Перемещение"  тогда
			ВариантЗаполнения=ВыбратьВариантЗаполнения();
		иначе
			ВариантЗаполнения="Целиком";
		КонецЕсли;	
		//Кухарь 09.04.18 конец	
		
	#КОНЕЦЕСЛИ
	
	Если ЭтоВозвратИМ = Истина Тогда
		// Шворобей ВЮ 07.11.2022 ++
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Основание", Основание.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Спайка,
		|	СУММА(ЕСТЬNULL(Товары.Количество, 0)) КАК КоличествоТовара,
		|	МАКСИМУМ(Товары.СтавкаНДС) КАК СтавкаНДС,
		|	МАКСИМУМ(Товары.Цена) КАК Цена
		|ПОМЕСТИТЬ ПНТовары
		|ИЗ
		|	Документ.ПриходнаяНакладная.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Основание
		|	И Товары.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Комплектующие.Номенклатура КАК Номенклатура,
		|	ПНТовары.Спайка КАК Продукция,
		|	МАКСИМУМ(Комплектующие.Единица) КАК Единица,
		|	СУММА(ЕСТЬNULL(ПНТовары.КоличествоТовара, 0) * ЕСТЬNULL(Комплектующие.Количество, 0)) КАК Количество,
		|	МАКСИМУМ(ЕСТЬNULL(Комплектующие.Количество, 0)) КАК КоличествоКомплектующих,
		|	МАКСИМУМ(1) КАК Коэффициент,
		|	МАКСИМУМ(ПНТовары.СтавкаНДС) КАК СтавкаНДС,
		|	МАКСИМУМ(ПНТовары.Цена) / МАКСИМУМ(ЕСТЬNULL(Комплектующие.Количество, 1)) КАК Цена
		|ИЗ
		|	Справочник.Номенклатура.Коплектующие КАК Комплектующие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПНТовары КАК ПНТовары
		|		ПО Комплектующие.Ссылка = ПНТовары.Спайка
		|
		|СГРУППИРОВАТЬ ПО
		|	Комплектующие.Номенклатура,
		|	ПНТовары.Спайка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Продукция";
		
		УстановитьПривилегированныйРежим(Истина);
		ВыборкаТЧ = Запрос.Выполнить().Выгрузить();
		УстановитьПривилегированныйРежим(Ложь);
		Товары.Загрузить(ВыборкаТЧ);
		
		Для Каждого СтрокаТЧ ИЗ Товары Цикл
			РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);	
		КонецЦикла;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Спайка,
		|	СУММА(ЕСТЬNULL(Товары.Количество, 0)) КАК КоличествоТовара,
		|	МАКСИМУМ(Товары.СтавкаНДС) КАК СтавкаНДС,
		|	МАКСИМУМ(Товары.Цена) КАК Цена
		|ПОМЕСТИТЬ ПНТовары
		|ИЗ
		|	Документ.ПриходнаяНакладная.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Основание
		|	И Товары.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПНТовары.Спайка КАК Номенклатура,
		|	Комплектующие.Номенклатура КАК Продукция,
		|	МАКСИМУМ(Комплектующие.Единица) КАК Единица,
		|	СУММА(ВЫБОР
		|			КОГДА Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
		|				ТОГДА ЕСТЬNULL(ПНТовары.КоличествоТовара, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Количество,
		|	МАКСИМУМ(ЕСТЬNULL(Комплектующие.Количество, 0)) КАК КоличествоКомплектующих,
		|	МАКСИМУМ(1) КАК Коэффициент,
		|	МАКСИМУМ(ПНТовары.СтавкаНДС) КАК СтавкаНДС,
		|	МАКСИМУМ(ПНТовары.Цена) КАК Цена
		|ИЗ
		|	Справочник.Номенклатура.Коплектующие КАК Комплектующие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПНТовары КАК ПНТовары
		|		ПО Комплектующие.Ссылка = ПНТовары.Спайка
		|
		|СГРУППИРОВАТЬ ПО
		|	Комплектующие.Номенклатура,
		|	ПНТовары.Спайка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Продукция";
		
		УстановитьПривилегированныйРежим(Истина);
		ВыборкаТЧ = Запрос.Выполнить().Выгрузить();
		УстановитьПривилегированныйРежим(Ложь);
		
		//// ВОТ ЗДЕСЬ РАЗБЕРЕМСЯ С КОЛИЧЕСТВОМ ЗАПЧАСТЕЙ /////////////////////////
		
		МассивНоменклатуры = ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(ВыборкаТЧ.ВыгрузитьКолонку("Номенклатура"));
		
		Для Каждого Номенклатура ИЗ МассивНоменклатуры Цикл
			НайденныеСтроки = ВыборкаТЧ.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
			Если НайденныеСтроки.Количество() > 1 Тогда
				счетчикТовара = 0;
				Для Каждого СтрокаТЧ ИЗ НайденныеСтроки Цикл
					Если ПолучитьРеквизитШапки(СтрокаТЧ.Продукция,"Родитель.ВидНоменклатуры")= Перечисления.ВидыНоменклаутры.Товар Тогда
            			Если счетчикТовара > 0 Тогда
                    		СтрокаТЧ.Количество = 0;
                		КонецЕсли;                                      
                		счетчикТовара = счетчикТовара + 1;             
					Иначе
						СтрокаТЧ.Количество = 0;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Комплектующие.Загрузить(ВыборкаТЧ);
		
		Для Каждого СтрокаТЧ ИЗ Комплектующие Цикл
			РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);	
		КонецЦикла;
		// Шворобей ВЮ 07.11.2022 ++
	Иначе	
		Для Каждого исхСтрокаТЧ Из Основание.Товары Цикл
			// Кухарь А.Ю. 02.09.2020 начало
			// На основании РНК создаём только на нужный товар
			//если ВидОснования="РасходнаяНакладная"  тогда
			//	если исхСтрокаТЧ.Номенклатура.Коплектующие.Количество()=0 тогда Продолжить;КонецЕсли;
			//КонецЕсли; 
			// Кухарь А.Ю. 02.09.2020 конец
			//Кухарь 09.04.18 начало
			//КМП теперь будут и на основании ПРМ
			//СтрокаТЧ = Товары.Добавить();
			если ВидОснования<>"Перемещение"  тогда
				СтрокаТЧ = Товары.Добавить();
			иначе
				СтрокаТЧ = Комплектующие.Добавить();
			КонецЕсли;	
			//Кухарь 09.04.18 конец
			
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);	
			Если ВариантЗаполнения="НехватающиеЗаявка" Тогда			
				СтрокаТЧ.Количество		=исхСтрокаТЧ.Заявка-исхСтрокаТЧ.Количество;			
			ИначеЕсли ВариантЗаполнения="НехватающиеПодтверждение" Тогда
				СтрокаТЧ.Количество		=исхСтрокаТЧ.ПодтвержденнаяЗаявка-исхСтрокаТЧ.Количество;			
			ИначеЕсли ВариантЗаполнения="Целиком" Тогда		
			КонецЕсли;		
			
			Если СтрокаТЧ.Количество=0 Тогда
				// Кухарь А.Ю. 05.10.2021 начало
				//Товары.Удалить(СтрокаТЧ);
				//У ПРМ всё в КМП
				если ВидОснования<>"Перемещение"  тогда
					Товары.Удалить(СтрокаТЧ);
				иначе
					Комплектующие.Удалить(СтрокаТЧ);
				КонецЕсли;
				// Кухарь А.Ю. 05.10.2021 конец
			Иначе
				РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
// Аналогично остальным накладным. Проводки делаем через ЗНБ
	Если  ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.Склад Тогда		
		Если Отгружен<>Перечисления.Отгружен.Отгружен Тогда
			Возврат;								
		КонецЕсли;		
	КонецЕсли; 
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	
	ДвиженияПоРегистрам=Неопределено;
	
	ТС=Неопределено;	
	РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка,ТС);	
	
	Результат=РезультатПроведения["Результат"];
	Если Результат<0 И НЕ ОбменДанными.Загрузка Тогда 			
		Отказ=Не(ПолучитьПолномочиеПользователя("СписыватьВМинус"));
		
		ВывестиТрассировку(РезультатПроведения["ТОшибок"],?(Отказ,-2,Результат));
	КонецЕсли;
	
	Если Отказ Тогда Возврат КонецЕсли;		
	
	ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);
	
	ТК=ТС.Скопировать();
	ТК.Свернуть("Номенклатура","Количество,СписанаСтоимость");
	Для Каждого СтрокаТЧ Из Комплектующие Цикл
		СтрокаТС=ТС.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");	
		//крохин начало 15.06.2022
		//Если СтрокаТС<>Неопределено Тогда
		Если СтрокаТС<>Неопределено И СтрокаТС.Количество <> 0 Тогда
		//крохин конец 15.06.2022	
			СтрокаТЧ.Всего=СтрокаТС.СписанаСтоимость*(СтрокаТЧ.Количество/СтрокаТС.Количество);
		Иначе
			СтрокаТЧ.Всего=0;			
		КонецЕсли; 
		РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект,"ОтВсего");	
	КонецЦикла; 
	
	ТС.Свернуть("Продукция","СписанаСтоимость");
	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаТС=ТС.Найти(СтрокаТЧ.Номенклатура,"Продукция");	
		Если СтрокаТС<>Неопределено Тогда
			СтрокаТЧ.Всего=СтрокаТС.СписанаСтоимость;
		Иначе
			СтрокаТЧ.Всего=0;			
		КонецЕсли; 
		РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект,"ОтВсего");		
	КонецЦикла;	
	СуммаДокумента=Товары.Итог("Всего");
	
	// Шворобей ВЮ 04.05.2022 +
	Если ЗначениеЗаполнено(ДокОснование)
		И ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ЗаявкаНаПерепаковку")
		И СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена Тогда
		
		//Кухарь А.Ю.  04.05.2022 начало
		//Списывать с пути будем в момент, когда падают остатки
		//Кухарь А.Ю.  04.05.2022 конец
		
		Если Товары.Количество() > 0 Тогда
			
			СтруктураОстатков = Документы.Перемещение.КонтрольПоРегиструСпайкиВПути(Ссылка, ДокОснование);
			
			Если ТипЗнч(СтруктураОстатков.ТаблицаНехватки) = Тип("ТаблицаЗначений")
				И СтруктураОстатков.ТаблицаНехватки.Количество() = 0 Тогда
			
				Движения.СпайкиВПути.Записывать = Истина;
				Движения.СпайкиВПути.Очистить();
				Для Каждого ТекСтрокаТовары Из Товары Цикл
					Движение = Движения.СпайкиВПути.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.Регистратор = Ссылка;
					Движение.Заявка = ДокОснование;
					Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
					Движение.Количество = ТекСтрокаТовары.Количество;
				КонецЦикла;
				Движения.СпайкиВПути.Записать(Истина);
				
			Иначе	
				 СообщитьИзМодуля("Остатков Спаек в пути не хватает!!!!");
				 Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		//Кухарь А.Ю.  04.05.2022 начало
		//Списывать с пути будем в момент, когда падают остатки
		//Кухарь А.Ю.  04.05.2022 конец
		
	КонецЕсли;
	// Шворобей ВЮ 04.05.2022 +
	
КонецПроцедуры

// кухарь 22.11.12 начало
//перенос резервов
Процедура ПеренестиРезерв() Экспорт
	НеКонтролироватьТА=Истина;
	Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	НеКонтролироватьТА=Ложь;
КонецПроцедуры 
// кухарь 22.11.12 конец

//+++Чирков 16.01.13 - больше исправлять не буду
Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение И СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена Тогда
		ЗаполнитьПервичнуюГруппуНоменклатуры(Товары.ВыгрузитьКолонку("Номенклатура"));	
		// Кухарь А.Ю.  06.03.2024 начало
		//
		если не ЭтоРаскомплектация тогда  
			// Кухарь А.Ю.  06.03.2024 конец
			
			//крохин начало 14.02.2013
			//ГТД и импортер
			ЗаполнитьИмпортераКМПЛ(Ссылка);
			//крохин конец 14.02.2013
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
//---Чирков 16.01.13


// Кухарь А.Ю. 12.05.2020 начало
// Удалим ЗНБ
Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	если ОбщегоНазначения_ПИ.ЭтоУзел_ODN_или_OD7() тогда 
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	ЗаданиеНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|ГДЕ
		|	ЗаданиеНабора.Проведен
		|	И ЗаданиеНабора.Накладная = &Накладная";
		запрос.УстановитьПараметр("Накладная",ЭтотОбъект.Ссылка);
		результат=запрос.Выполнить().Выбрать();
		пока результат.Следующий() цикл
			ЗНБ=результат.Ссылка.получитьобъект();
			если ложь тогда ЗНБ=Документы.ЗаданиеНабора.ПустаяСсылка().ПолучитьОбъект();КонецЕсли;
			ЗНБ.УстановитьПометкуУдаления(Истина);	
		КонецЦикла;
	КонецЕсли;
	//Кухарь 03.12.19 конец	
	
КонецПроцедуры

// Кухарь А.Ю. 12.05.2020 конец
